In [1]:
#
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from numpy import nan as NA
import sys

In [2]:
#
import matplotlib.pylab as plt
from numpy.random import randn
%matplotlib inline

# Chapter 7: Data Wrangling: Clean, Transform, Merge, Reshape

Run next cell to create df1 and df2

In [3]:
#
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                 'data1': range(6)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [4]:
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                 'data2': range(5)})
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

Merge (join) df1 and df2 on their shared column name. Try inner, left, right, and outer merge and verify your expectation

In [5]:
pd.merge(df1, df2, on='key', how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [6]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [7]:
pd.merge(df1, df2, on='key', how='right')

    data1 key  data2
0     0.0   b      1
1     1.0   b      1
2     5.0   b      1
3     0.0   b      3
4     1.0   b      3
5     5.0   b      3
6     2.0   a      0
7     4.0   a      0
8     2.0   a      2
9     4.0   a      2
10    NaN   d      4

In [8]:
pd.merge(df1, df2, on='key', how='outer')

    data1 key  data2
0     0.0   b    1.0
1     0.0   b    3.0
2     1.0   b    1.0
3     1.0   b    3.0
4     5.0   b    1.0
5     5.0   b    3.0
6     2.0   a    0.0
7     2.0   a    2.0
8     4.0   a    0.0
9     4.0   a    2.0
10    3.0   c    NaN
11    NaN   d    4.0

Run next cell to creata df3 and df4

In [9]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'],
                 'data2': range(3)})

Merge df3 and df4 on 'lkey' and 'rkey'

In [10]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

Run next cell to create 'left' and 'right'

In [11]:
#
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                  'key2': ['one', 'two', 'one'],
                  'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'rval': [4, 5, 6, 7]})

Merge left and right by two keys of key1 and key2, and verify your thoughts. Try both inner and outer

In [12]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [13]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [14]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [15]:
pd.merge(left, right, how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

Merge left and right on key1 only

In [16]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

Run next cell to generate left1 and right1

In [17]:
#
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                   'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

Observe left1 and right1, then merge them

In [18]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [19]:
right1

   group_val
a        3.5
b        7.0

In [20]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

Run next cell to create left2 and right2

In [21]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],
                  columns=['Ohio', 'Nevada'])
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])

Observe left2 and right2, and merge them

In [22]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [23]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [24]:
pd.merge(left2, right2, left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

Run next cell to create series s1, s2, and s3

In [25]:
#
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([4, 5], index=['f', 'g'])

Concatenate s1, s2, and s3 by default settings

In [26]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    4
g    5
dtype: int64

Now cnocatenate them by axis 1

In [27]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  4.0
g  NaN  NaN  5.0

Now repeat last question but requst inner join on axis 0. Verify your thought

In [28]:
pd.concat([s1, s2, s3], axis=1, join='inner')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

Run next cell to create s4

In [29]:
#
s4 = pd.concat([s1*5, s3])
s4

a    0
b    5
f    4
g    5
dtype: int64

Now concatenate s4 and s1 in axis 0 and 1 separately, and verify your thought

In [30]:
s1

a    0
b    1
dtype: int64

In [31]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  4
g  NaN  5

Concatenate s1, s2, and s3 in axis 0, and assign keys to identify the groups

In [32]:
pd.concat([s1, s2, s3], keys=['s1', 's2', 's3'], axis=0)

s1  a    0
    b    1
s2  c    2
    d    3
    e    4
s3  f    4
    g    5
dtype: int64

Run next cell to create df1 and df2

In [33]:
#
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                columns=['one', 'two'])
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                columns=['three', 'two'])

Concategate df1 and df2 in two axises, and distinguish df1 and df2 by using keys; verify your thought.

In [34]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [35]:
df2

   three  two
a      5    6
c      7    8

In [36]:
pd.concat([df1, df2], axis=0, keys=['df1', 'df2'])

       one  three  two
df1 a  0.0    NaN    1
    b  2.0    NaN    3
    c  4.0    NaN    5
df2 a  NaN    5.0    6
    c  NaN    7.0    8

In [37]:
pd.concat([df1, df2], axis=1, keys=['df1', 'df2'])

  df1       df2
  one two three  two
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

Run next cell to create df1 and df2

In [38]:
#
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [39]:
df1

          a         b         c         d
0  0.143950  0.262374  0.606841 -0.078563
1 -0.876565  0.300456  0.753347  0.089790
2 -1.507619 -1.129144  0.109146  0.040120

In [40]:
df2

          b         d         a
0 -0.501690 -0.306279  2.251153
1 -1.399742  0.605374 -2.041045

Concatenate df1 and df2. Since their index has no physical meaning, ignore the index.

In [41]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.143950  0.262374  0.606841 -0.078563
1 -0.876565  0.300456  0.753347  0.089790
2 -1.507619 -1.129144  0.109146  0.040120
3  2.251153 -0.501690       NaN -0.306279
4 -2.041045 -1.399742       NaN  0.605374

Run next cell to create series a and b

In [42]:
#
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index=['f', 'e', 'd', 'c', 'b', 'a'])
b = Series(np.arange(len(a), dtype=np.float64),
           index=['f', 'e', 'd', 'c', 'b', 'a'])

In [43]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [44]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

Fill in the missing values in a by the correspoing values in b

In [45]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

Run next cell to create df1 and df2

In [46]:
#
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],
                 'b': [np.nan, 2., np.nan, 6.],
                 'c': range(2, 18, 4)})
df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],
                 'b': [np.nan, 3., 4., 6., 8.]})

In [47]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [48]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

Similarly, fill in the missing values in df1 by df2

In [49]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

Try df1.combine_first(df2) and df1.fillna(df2) and observe the difference.

In [50]:
df1.fillna(df2)

     a    b   c
0  1.0  NaN   2
1  4.0  2.0   6
2  5.0  4.0  10
3  3.0  6.0  14

Run next cell to create DataFrame 'data'

In [51]:
#
data = DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

Reshaping: Stack DataFrame data to a series 'result'. Stack would generate longer dataframe or series

In [52]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

Reshaping: Unstack result to recover data. Unstack would generate shorter data frame

In [53]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

Reshaping: Try two methods to unstack result by "state"

In [54]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [55]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

Note that the level stacked or unstacke would become the lowest level in the other axis

Create a data frame ldata by reading ldata.txt

In [56]:
ldata=pd.read_csv('ldata.txt')
ldata

                  date     item     value
0  1959-03-31 00:00:00  realgdp  2710.349
1  1959-03-31 00:00:00     infl     0.000
2  1959-03-31 00:00:00    unemp     5.800
3  1959-06-30 00:00:00  realgdp  2778.801
4  1959-06-30 00:00:00     infl     2.340
5  1959-06-30 00:00:00    unemp     5.100
6  1959-09-30 00:00:00  realgdp  2775.488
7  1959-09-30 00:00:00     infl     2.740
8  1959-09-30 00:00:00    unemp     5.300
9  1959-12-31 00:00:00  realgdp  2785.204

In ldata, date and item are the primary keys. Now create a pivoted data frame by these two keys

In [57]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item                 infl   realgdp  unemp
date
1959-03-31 00:00:00  0.00  2710.349    5.8
1959-06-30 00:00:00  2.34  2778.801    5.1
1959-09-30 00:00:00  2.74  2775.488    5.3
1959-12-31 00:00:00   NaN  2785.204    NaN

Now add another column 'value2' of random number to ldata

In [58]:
ldata['value2'] = np.random.randn(len(ldata))
ldata

                  date     item     value    value2
0  1959-03-31 00:00:00  realgdp  2710.349 -0.046263
1  1959-03-31 00:00:00     infl     0.000  1.507909
2  1959-03-31 00:00:00    unemp     5.800  0.508403
3  1959-06-30 00:00:00  realgdp  2778.801 -0.504166
4  1959-06-30 00:00:00     infl     2.340  1.870141
5  1959-06-30 00:00:00    unemp     5.100  1.764257
6  1959-09-30 00:00:00  realgdp  2775.488  0.146494
7  1959-09-30 00:00:00     infl     2.740  0.036097
8  1959-09-30 00:00:00    unemp     5.300 -1.141841
9  1959-12-31 00:00:00  realgdp  2785.204 -0.637991

Now pivot again and keep value2 only.

In [59]:
ldata.pivot('date', 'item', 'value2')

item                     infl   realgdp     unemp
date
1959-03-31 00:00:00  1.507909 -0.046263  0.508403
1959-06-30 00:00:00  1.870141 -0.504166  1.764257
1959-09-30 00:00:00  0.036097  0.146494 -1.141841
1959-12-31 00:00:00       NaN -0.637991       NaN

Pivot again and keep both value and value2

In [60]:
ldata.pivot('date', 'item')

                    value                    value2
item                 infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31 00:00:00  0.00  2710.349   5.8  1.507909 -0.046263  0.508403
1959-06-30 00:00:00  2.34  2778.801   5.1  1.870141 -0.504166  1.764257
1959-09-30 00:00:00  2.74  2775.488   5.3  0.036097  0.146494 -1.141841
1959-12-31 00:00:00   NaN  2785.204   NaN       NaN -0.637991       NaN

Pivot is just a shorcut for creating hierarchical index using set_index and reshaping with unstack. Now use set_index and unstack to sovle last question.

In [61]:
ldata.set_index(['date', 'item']).unstack('item')

                    value                    value2
item                 infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31 00:00:00  0.00  2710.349   5.8  1.507909 -0.046263  0.508403
1959-06-30 00:00:00  2.34  2778.801   5.1  1.870141 -0.504166  1.764257
1959-09-30 00:00:00  2.74  2775.488   5.3  0.036097  0.146494 -1.141841
1959-12-31 00:00:00   NaN  2785.204   NaN       NaN -0.637991       NaN

Run next cell to create DataFrame data

In [62]:
#
data = DataFrame({'k1': ['one']*3 + ['two']*4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

Check which row of data is a duplicated row

In [63]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

Now drop all duplicated rows

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

Now add a new column 'v1' = range(7) to data

In [65]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

Now drop duplicate based on k1

In [66]:
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
3  two   3   3

Now drop duplicates by k1 and k2

In [67]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

Drop dulicates by k1 and k2, and keep the last value instead of the first value

In [68]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

Run the next line to create a data frame of 'data'

In [69]:
#
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                            'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Run next line to create a mapping from 'food' to 'animal'

In [70]:
#
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

Now add another column 'animal' to data by the mapping above. Note that the mapping should be case insensitive.

In [71]:
data['animal'] = data.food.map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Run the next line to create a series 'data'

In [72]:
data = Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

Now replace -999 by np.nan and return as data1

In [73]:
data1 = data.replace(-999, np.nan)
data1

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

Now replace both -999 and -1000 by np.nan and return as data2

In [74]:
data2 = data.replace([-999, -1000], np.nan)
data2

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Now replace -999 by np.nan, -1000 by 0

In [75]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Run next line to create a data frame "data"

In [76]:
#
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

Now change the index of data to UPPERCASE in place using the map function

In [77]:
data.index = data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

Change the index to title format and change the column names to uppercase by using rename method

In [78]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

For data, change the index of 'OHIO' to 'INDIANA' and change the column of 'three' to 'peekaboo'; do this in place

In [79]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'}, inplace=True)
data

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

Run the next line to create a list

In [80]:
#
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Now create a series showing the number of elements in ages falling into these four groups: (18, 25], (25, 35], (35,60], (60, 100], and name these groups as 'Youth', 'YoungAdult', 'MiddleAged', 'Senior'

In [81]:
cats = pd.cut(ages, [18, 25, 35, 60, 100], 
              labels=['Youth', 'YoungAdult', 'MiddleAged', 'Senior'])
result = pd.value_counts(cats)
result

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

Create a data frame 'data' from a 1000*4 radom number matrix, which is generate from seed of 12345

In [82]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000, 4))

Show the description of data

In [83]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

Find out all rows that has 1 or more values exceeding 3 or -3

In [84]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

For data, replace a value by 3 if it is larger than 3; by -3 if it is smaller than -3

In [85]:
data[data>3] = 3
data[data<-3] = -3

Now show the description of data again to verify the result

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

Run the next line to generate a data frame df

In [87]:
#
df = DataFrame(np.arange(5*4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

Now permutate (randomly reorder) the rows in df

In [88]:
sampler = np.random.permutation(len(df))
df.iloc[sampler]

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

Randomly select three rows from data without replacement

In [89]:
df.iloc[np.random.permutation(len(df))[:3]]

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

Now randomly select three rows from data with replacement

In [90]:
sampler = np.random.randint(0, len(df), size=3)
df.iloc[sampler]

    0   1   2   3
4  16  17  18  19
4  16  17  18  19
2   8   9  10  11

Run next line to create a data frame 'df'

In [91]:
#
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

Now create a new data frame showing the dummy matrix of df.key

In [92]:
pd.get_dummies(df.key)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

Create a data frame movies from movies.dat with column names of 'movie_id', 'title', 'genres'

In [93]:
movies = pd.read_csv('datasets/movielens/movies.dat',
                      sep='::', header=None,
                      names=['movie_id', 'title', 'genres'],
                    engine='python')

In [94]:
movies.head(10)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

Get a list of unique movie genres, sorted alphabetically

In [95]:
genre_iter = [set(x.split('|')) for x in movies.genres]
genres = sorted(set.union(*genre_iter))
genres

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']